openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Can.c
typedef enum {
    CAN_UNINIT = 0, CAN_READY
} Can_DriverStateType;


typedef union {
    vuint32_t R;
    struct {
        vuint32_t :14;
        vuint32_t TWRNINT :1;
        vuint32_t RWRNINT :1;
        vuint32_t BIT1ERR :1;
        vuint32_t BIT0ERR :1;
        vuint32_t ACKERR :1;
        vuint32_t CRCERR :1;
        vuint32_t FRMERR :1;
        vuint32_t STFERR :1;
        vuint32_t TXWRN :1;
        vuint32_t RXWRN :1;
        vuint32_t IDLE :1;
        vuint32_t TXRX :1;
        vuint32_t FLTCONF :2;
        vuint32_t :1;
        vuint32_t BOFFINT :1;
        vuint32_t ERRINT :1;
        vuint32_t WAKINT :1;
    } B;
} ESRType; /* Error and Status Register */


/* Type for holding global information used by the driver */
typedef struct {
    Can_DriverStateType     initRun;            /* If Can_Init() have been run */
    const Can_ConfigType *  config;             /* Pointer to config */
    uint32                  configuredMask;     /* What units are configured */
} Can_GlobalType;


/* Type for holding information about each controller */
typedef struct {
    /* This unit have uses controller */
    CanControllerIdType                 controllerId;
    CanIf_ControllerModeType            state;
    const Can_ControllerConfigType *    cfgCtrlPtr;     /* Pointer to controller config  */
    const Can_HardwareObjectType *      cfgHohPtr;     /* List of HOHs */
    flexcan_t *                         hwPtr;
    uint32      lock_cnt;
    uint64      Can_Arc_RxMbMask;
    uint64      Can_Arc_TxMbMask;
    uint64      mbTxFree;
    uint8_t     mbMax;                              /* Max number of mailboxes used for this unit */
//    PduIdType   swPduHandles[MAX_NUM_OF_MAILBOXES]; /* Data stored for Txconfirmation callbacks to CanIf */
//    uint8_t     mbToHrh[MAX_NUM_OF_MAILBOXES];      /* Mapping from mailbox to HRH */
#if (USE_CAN_STATISTICS == STD_ON)
    Can_Arc_StatisticsType stats;
#endif
} Can_UnitType;

/* ----------------------------[private function prototypes]-----------------*/
static void Can_Isr(int unit);
static void Can_Err(int unit);
static void Can_BusOff(int unit);

/* ----------------------------[private variables]---------------------------*/

Can_UnitType    CanUnit[CAN_ARC_CTRL_CONFIG_CNT];
Can_GlobalType  Can_Global = { .initRun = CAN_UNINIT, };
/* Used by ISR */
//uint8_t         Can_CtrlToUnitMap[CAN_ARC_CTRL_CONFIG_CNT];
/* Used by Can_Write() */
//uint8_t         Can_HthToUnitIdMap[NUM_OF_HTHS];
//uint8_t         Can_HthToHohMap[NUM_OF_HTHS];

/* ----------------------------[private functions]---------------------------*/

static void clearMbFlag( flexcan_t * hw,  uint8_t mb ) {
    if( mb >= 32) {
        hw->IFRH.R = (1<<(mb-32));
    } else {
        hw->IFRL.R = (1<<mb);
    }
}

static inline uint64_t ilog2_64( uint64_t val ) {
    uint32_t t = val >> 32;

    if( t != 0) {
        return ilog2(t) + 32;
    }
    return ilog2((uint32_t)val);
}

void Can_A_Isr(void)
{
    Can_Isr(CAN_CTRL_A);
}
void Can_B_Isr(void)
{
    Can_Isr(CAN_CTRL_B);
}
#if defined(CFG_MPC5516) || defined(CFG_MPC5517) || defined(CFG_MPC5567) || defined(CFG_MPC5668) || defined(CFG_MPC5604B)
void Can_C_Isr( void ) {Can_Isr(CAN_CTRL_C);}
void Can_D_Isr( void ) {Can_Isr(CAN_CTRL_D);}
void Can_E_Isr( void ) {Can_Isr(CAN_CTRL_E);}
#endif
#if defined(CFG_MPC5516) || defined(CFG_MPC5517) || defined(CFG_MPC5668) || defined(CFG_MPC5604B)
void Can_F_Isr( void ) {Can_Isr(CAN_CTRL_F);}
#endif

void Can_A_Err(void)
{
    Can_Err(CAN_CTRL_A);
}
void Can_B_Err(void)
{
    Can_Err(CAN_CTRL_B);
}
#if defined(CFG_MPC5516) || defined(CFG_MPC5517) || defined(CFG_MPC5567) || defined(CFG_MPC5668) || defined(CFG_MPC5604B)
void Can_C_Err( void ) {Can_Err(CAN_CTRL_C);}
void Can_D_Err( void ) {Can_Err(CAN_CTRL_D);}
void Can_E_Err( void ) {Can_Err(CAN_CTRL_E);}
#endif
#if defined(CFG_MPC5516) || defined(CFG_MPC5517) || defined(CFG_MPC5668) || defined(CFG_MPC5604B)
void Can_F_Err( void ) {Can_Err(CAN_CTRL_F);}
#endif

void Can_A_BusOff(void)
{
    Can_BusOff(CAN_CTRL_A);
}
void Can_B_BusOff(void)
{
    Can_BusOff(CAN_CTRL_B);
}
#if defined(CFG_MPC5516) || defined(CFG_MPC5517) || defined(CFG_MPC5567) || defined(CFG_MPC5668) || defined(CFG_MPC5604B)
void Can_C_BusOff( void ) {Can_BusOff(CAN_CTRL_C);}
void Can_D_BusOff( void ) {Can_BusOff(CAN_CTRL_D);}
void Can_E_BusOff( void ) {Can_BusOff(CAN_CTRL_E);}
#endif
#if defined(CFG_MPC5516) || defined(CFG_MPC5517) || defined(CFG_MPC5668) || defined(CFG_MPC5604B)
void Can_F_BusOff( void ) {Can_BusOff(CAN_CTRL_F);}
#endif
//-------------------------------------------------------------------


/**
 * Hardware error ISR for CAN
 *
 * @param unit CAN controller number( from 0 )
 */

static void Can_Err(int unit)
{
    flexcan_t *canHw = GET_CONTROLLER(unit);
    Can_Arc_ErrorType err;
    ESRType esr;
    const ESRType esrWrite = { .B.ERRINT = 1 };
    err.R = 0;

    /* Clear bits 16-23 by read */
    esr.R = canHw->ESR.R;

    if (GET_CALLBACKS()->Arc_Error != NULL) {
        GET_CALLBACKS()->Arc_Error(unit, err);
    }

    /* TODO: To avoid flooding the CPU with errors some intelligent
     * decisions have to be made here. CanSM should handle this.
     * (not implemented)
     *
     * So, turn the interrupts OFF.
     */
    canHw->CR.B.ERRMSK = 0;

    // Clear ERRINT
    canHw->ESR.R = esrWrite.R;
}

/**
 *
 * @param canHw
 * @param canUnit
 */
// Uses 25.4.5.1 Transmission Abort Mechanism
static void Can_AbortTx(flexcan_t *canHw, Can_UnitType *canUnit)
{
    uint32 mbMask;
    uint8 mbNr;

    // Find our Tx boxes.
    mbMask = canUnit->Can_Arc_TxMbMask;

    // Loop over the Mb's set to abort
    for (; mbMask; mbMask &= ~(1 << mbNr)) {
        mbNr = ilog2(mbMask);

        canHw->BUF[mbNr].CS.B.CODE = MB_ABORT;

        // Did it take
        if (canHw->BUF[mbNr].CS.B.CODE != MB_ABORT) {
            // nope..

