openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Can.c
            /* it's not sent... or being sent.
             * Just wait for it
             *
             * TODO: Add 64 box support
             */
            int i = 0;
            while (canHw->IFRL.R == (1 << mbNr)) {
                i++;
                if (i > 1000)
                    break;
            }
        }
    }

    // Ack tx interrupts, TODO: Add 64bit support
    canHw->IFRL.R = canUnit->Can_Arc_TxMbMask;
}


/**
 * BusOff ISR for CAN
 *
 * @param unit CAN controller number( from 0 )
 */
static void Can_BusOff(int unit)
{
    flexcan_t *canHw = GET_CONTROLLER(unit);
    Can_UnitType *canUnit = CTRL_TO_UNIT_PTR(unit);
    Can_Arc_ErrorType err;
    err.R = 0;

#if (USE_CAN_STATISTICS == STD_ON)
    if (canHw->ESR.B.TWRNINT) {
        err.B.TXWRN = canHw->ESR.B.TXWRN;
        canUnit->stats.txErrorCnt++;
        canHw->ESR.B.TWRNINT = 1;
    }

    if (canHw->ESR.B.RWRNINT) {
        err.B.RXWRN = canHw->ESR.B.RXWRN;
        canUnit->stats.rxErrorCnt++;
        canHw->ESR.B.RWRNINT = 1;
    }
#endif

    if (err.R != 0) {
        if (GET_CALLBACKS()->Arc_Error != NULL) {
            GET_CALLBACKS()->Arc_Error(unit, err);
        }
    }

    if (canHw->ESR.B.BOFFINT) {
#if (USE_CAN_STATISTICS == STD_ON)
        canUnit->stats.boffCnt++;
#endif
        if (GET_CALLBACKS()->ControllerBusOff != NULL) {
            GET_CALLBACKS()->ControllerBusOff(unit);
        }
        Can_SetControllerMode(unit, CAN_T_STOP); // CANIF272

        canHw->ESR.B.BOFFINT = 1;

        Can_AbortTx(canHw, canUnit); // CANIF273
    }
}

/**
 *
 * @param uPtr
 */
static void Can_Isr_Tx(Can_UnitType *uPtr)
{
    uint8 mbNr;
    flexcan_t *canHw;

    canHw = uPtr->hwPtr;

    uint64_t mbMask = *(uint64_t *) (&canHw->IFRH.R);
    mbMask &= uPtr->Can_Arc_TxMbMask;

    /*
     * Tx
     */
    for (; mbMask; mbMask &= ~(1ull << mbNr)) {
        mbNr = ilog2_64(mbMask);

        if (GET_CALLBACKS()->TxConfirmation != NULL) {
            GET_CALLBACKS()->TxConfirmation(uPtr->cfgCtrlPtr->Can_Arc_TxPduHandles[mbNr-uPtr->cfgCtrlPtr->Can_Arc_TxMailboxStart]);
        }
        uPtr->cfgCtrlPtr->Can_Arc_TxPduHandles[mbNr-uPtr->cfgCtrlPtr->Can_Arc_TxMailboxStart] = 0;
//        uPtr->swPduHandles[mbNr] = 0; // Is this really necessary ??

        // Clear interrupt
        clearMbFlag(canHw,mbNr);
        uPtr->mbTxFree |= (1ull << mbNr);
    }
}

static void Can_Isr_Rx(Can_UnitType *uPtr)
{
    uint8 mbNr;
    uint32 id;
    uint32 mask;

    flexcan_t *canHw;
    const Can_HardwareObjectType *hohPtr;

    canHw = uPtr->hwPtr;

    uint64_t iFlag = *(uint64_t*) (&canHw->IFRH.R);

    while (iFlag & uPtr->Can_Arc_RxMbMask) {

        /* Find mailbox */
        mbNr = ilog2_64(iFlag);
        iFlag ^= 1ull << mbNr;

        /* Check for FIFO interrupt */
        if (canHw->MCR.B.FEN && ((uint32_t)iFlag & (1 << 5))) {

            /* Check overflow */
            if (iFlag & (1 << 7)) {
#if (USE_CAN_STATISTICS == STD_ON)
                uPtr->stats.fifoOverflow++;
#endif
                canHw->IFRL.B.BUF07I = 1;

                DET_REPORTERROR(MODULE_ID_CAN,0,0, CAN_E_DATALOST); /** @req 4.0.3/CAN395 */
            }

#if (USE_CAN_STATISTICS == STD_ON)
            /* Check warning */
            if (iFlag & (1 << 6)) {
                uPtr->stats.fifoWarning++;
                canHw->IFRL.B.BUF06I = 1;
            }
#endif

            /* The manual is "fuzzy" here, read control and status */
            (void) canHw->BUF[0].CS.R;

            if (canHw->BUF[0].CS.B.IDE) {
                id = canHw->BUF[0].ID.R;
                id |= 0x80000000;
            } else {
                id = canHw->BUF[0].ID.B.STD_ID;
            }

            /* Must now do a manual match to find the right CanHardwareObject
             * to pass to CanIf. We know that the FIFO objects are sorted first.
             */
            hohPtr = uPtr->cfgCtrlPtr->Can_Arc_Hoh;

            /* Match in order */
            vuint32_t *fifoIdPtr = (vuint32_t *) &canHw->BUF[6];

            for (mbNr = 0; mbNr < uPtr->cfgCtrlPtr->Can_Arc_HohFifoCnt; mbNr++) {
                mask = canHw->RXIMR[mbNr].R;

                if ((id & mask) != (fifoIdPtr[mbNr] & mask)) {
                    continue;
                }

                if (GET_CALLBACKS()->RxIndication != NULL) {
                    GET_CALLBACKS()->RxIndication(uPtr->cfgCtrlPtr->Can_Arc_MailBoxToHrh[mbNr],
                            canHw->BUF[0].ID.B.EXT_ID,
                            canHw->BUF[0].CS.B.LENGTH,
                            (uint8 *) &canHw->BUF[0].DATA.W[0]);
                }
                break;
            }

            // Clear the interrupt
            canHw->IFRL.B.BUF05I = 1;
        } else {
            /* Not FIFO */

            /* activate the internal lock with a read*/
            (void) canHw->BUF[mbNr].CS.R;

            if (canHw->BUF[mbNr].CS.B.IDE) {
                id = canHw->BUF[mbNr].ID.R;
                id |= 0x80000000;
            } else {
                id = canHw->BUF[mbNr].ID.B.STD_ID;
            }

#if defined(USE_DET)
            if( canHw->BUF[mbNr].CS.B.CODE == MB_RX_OVERRUN ) {
                /* We have overwritten one frame */
                Det_ReportError(MODULE_ID_CAN,0,0,CAN_E_DATALOST); /** @req 4.0.3/CAN395 */
            }
#endif

            if (GET_CALLBACKS()->RxIndication != NULL) {
                GET_CALLBACKS()->RxIndication(uPtr->cfgCtrlPtr->Can_Arc_MailBoxToHrh[mbNr], id,
                        canHw->BUF[mbNr].CS.B.LENGTH,
                        (uint8 *) &canHw->BUF[mbNr].DATA.W[0]);
            }
#if (USE_CAN_STATISTICS == STD_ON)
            uPtr->stats.rxSuccessCnt++;
#endif
            /* unlock MB (dummy read timer) */
            (void) canHw->TIMER.R;

            // Clear interrupt
            clearMbFlag(canHw, mbNr);
        }
    }
}


static void Can_Isr(int controller )
{
    Can_UnitType *uPtr = &CanUnit[controller];

    if(uPtr->cfgCtrlPtr->Can_Arc_Flags & CAN_CTRL_TX_PROCESSING_INTERRUPT ){
        Can_Isr_Tx(uPtr);
    }

