openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Can.c
    if(uPtr->cfgCtrlPtr->Can_Arc_Flags & CAN_CTRL_RX_PROCESSING_INTERRUPT ){
        Can_Isr_Rx(uPtr);
    }
}


//-------------------------------------------------------------------


static void Can_BuildMaps(Can_UnitType *uPtr)
{
#if 0
    uint8_t mbNr = 8;
    uint8_t fifoNr = 0;

    const Can_HardwareObjectType *hohPtr = uPtr->cfgCtrlPtr->Can_Arc_Hoh;

    printf("Found %d HOHs\n", uPtr->cfgCtrlPtr->Can_Arc_HohCnt);

    for (int i = 0; i < uPtr->cfgCtrlPtr->Can_Arc_HohCnt; i++, hohPtr++) {
        if (hohPtr->CanObjectType == CAN_OBJECT_TYPE_RECEIVE) {
            /* First 8 boxes are FIFO */
            if (hohPtr->Can_Arc_Flags & CAN_HOH_FIFO_MASK) {
                uPtr->mbToHrh[fifoNr++] = hohPtr->CanObjectId;
                uPtr->Can_Arc_RxMbMask |= (1<<5);
            } else {
                uint64_t mask = (-1ULL);
                uPtr->mbToHrh[mbNr] = hohPtr->CanObjectId;

                mask >>= (mbNr);
                mask <<= (mbNr);
                mask <<= 64 - (mbNr + hohPtr->ArcCanNumMailboxes);
                mask >>= 64 - (mbNr + hohPtr->ArcCanNumMailboxes);
                uPtr->Can_Arc_RxMbMask |= mask;

                mbNr += hohPtr->ArcCanNumMailboxes;
            }
            printf("mbNr=%d fifoNr=%d\n", mbNr, fifoNr);

        } else {
            uint64_t mask = (-1ULL);

            /* Hth to HOH
             * i = index into the HOH list for this controller */
            Can_HthToHohMap[ hohPtr->CanObjectId ] = i;
            Can_HthToUnitIdMap[ hohPtr->CanObjectId ] = uPtr->controllerId;
            /* HOH to Mailbox */
            for( int j=0;j < hohPtr->ArcCanNumMailboxes; j++ ) {
                uPtr->mbToHrh[mbNr+j] = hohPtr->CanObjectId;
            }

            mask >>= (mbNr);
            mask <<= (mbNr);
            mask <<= 64 - (mbNr + hohPtr->ArcCanNumMailboxes);
            mask >>= 64 - (mbNr + hohPtr->ArcCanNumMailboxes);
            uPtr->Can_Arc_TxMbMask |= mask;
            mbNr += hohPtr->ArcCanNumMailboxes;
        }
    }
    uPtr->mbMax = mbNr;
#endif
}



// This initiates ALL can controllers
void Can_Init(const Can_ConfigType *config)
{
    /** @req 3.1.5/CAN223 */
    /** !req 3.1.5/CAN176 */

    Can_UnitType *unitPtr;

    /** @req 3.1.5/CAN174 */
    VALIDATE_NO_RV( (Can_Global.initRun == CAN_UNINIT), CAN_INIT_SERVICE_ID, CAN_E_TRANSITION );
    /** @req 3.1.5/CAN175 */
    VALIDATE_NO_RV( (config != NULL ), CAN_INIT_SERVICE_ID, CAN_E_PARAM_POINTER );

    // Save config
    Can_Global.config = config;
    Can_Global.initRun = CAN_READY;

    for (int configId = 0; configId < CAN_ARC_CTRL_CONFIG_CNT; configId++) {
        const Can_ControllerConfigType *cfgCtrlPtr  = &Can_Global.config->CanConfigSet->CanController[configId];

        Can_Global.configuredMask |= (1 << cfgCtrlPtr->CanControllerId);
        unitPtr = &CanUnit[configId];

        memset(unitPtr, 0, sizeof(Can_UnitType));

        unitPtr->controllerId = cfgCtrlPtr->CanControllerId;
        unitPtr->hwPtr = GET_CONTROLLER(cfgCtrlPtr->CanControllerId);
        unitPtr->cfgCtrlPtr = cfgCtrlPtr;
        unitPtr->state = CANIF_CS_STOPPED;
        unitPtr->cfgHohPtr = cfgCtrlPtr->Can_Arc_Hoh;

        unitPtr->Can_Arc_RxMbMask = cfgCtrlPtr->Can_Arc_RxMailBoxMask;
        unitPtr->Can_Arc_TxMbMask = cfgCtrlPtr->Can_Arc_TxMailBoxMask;

        Can_BuildMaps(unitPtr);

        Can_InitController(cfgCtrlPtr->CanControllerId,unitPtr->cfgCtrlPtr);

        switch (cfgCtrlPtr->CanControllerId) {
#if defined(CFG_MPC5606S)
        case CAN_CTRL_A:
        ISR_INSTALL_ISR2( "Can", Can_A_BusOff, FLEXCAN_0_ESR_BOFF_INT, 2, 0);
        ISR_INSTALL_ISR2( "Can", Can_A_Err, FLEXCAN_0_ESR_ERR_INT, 2, 0 );
        INSTALL_HANDLER4( "Can", Can_A_Isr, FLEXCAN_0_BUF_00_03, 2, 0 ); /* 0-3, 4-7, 8-11, 12-15 */
        ISR_INSTALL_ISR2( "Can", Can_A_Isr, FLEXCAN_0_BUF_16_31, 2, 0 );
        ISR_INSTALL_ISR2( "Can", Can_A_Isr, FLEXCAN_0_BUF_32_63, 2, 0 );
        break;
        case CAN_CTRL_B:
        ISR_INSTALL_ISR2( "Can", Can_B_BusOff, FLEXCAN_1_ESR_BOFF_INT, 2, 0);
        ISR_INSTALL_ISR2( "Can", Can_B_Err, FLEXCAN_1_ESR_ERR_INT, 2, 0 );
        INSTALL_HANDLER4( "Can", Can_B_Isr, FLEXCAN_1_BUF_00_03, 2, 0 ); /* 0-3, 4-7, 8-11, 12-15 */
        ISR_INSTALL_ISR2( "Can", Can_B_Isr, FLEXCAN_1_BUF_16_31, 2, 0 );
        ISR_INSTALL_ISR2( "Can", Can_B_Isr, FLEXCAN_1_BUF_32_63, 2, 0 );
        break;
#elif defined(CFG_MPC5516) || defined(CFG_MPC5517) || defined(CFG_MPC5567) || defined(CFG_MPC5604B)
        case CAN_CTRL_A:
        ISR_INSTALL_ISR2( "Can", Can_A_BusOff, FLEXCAN_A_ESR_BOFF_INT, 2, 0);
        ISR_INSTALL_ISR2( "Can", Can_A_Err, FLEXCAN_A_ESR_ERR_INT, 2, 0 );
        INSTALL_HANDLER16( "Can", Can_A_Isr, FLEXCAN_A_IFLAG1_BUF0I, 2, 0 );
        ISR_INSTALL_ISR2( "Can", Can_A_Isr, FLEXCAN_A_IFLAG1_BUF31_16I, 2, 0 );
        ISR_INSTALL_ISR2( "Can", Can_A_Isr, FLEXCAN_A_IFLAG1_BUF63_32I, 2, 0 );
        break;
        case CAN_CTRL_B:
        ISR_INSTALL_ISR2( "Can", Can_B_BusOff, FLEXCAN_B_ESR_BOFF_INT, 2, 0 );
        ISR_INSTALL_ISR2( "Can", Can_B_Err, FLEXCAN_B_ESR_ERR_INT, 2, 0 );
        INSTALL_HANDLER16( "Can", Can_B_Isr, FLEXCAN_B_IFLAG1_BUF0I, 2, 0 );
        ISR_INSTALL_ISR2( "Can", Can_B_Isr, FLEXCAN_B_IFLAG1_BUF31_16I, 2, 0 );
        ISR_INSTALL_ISR2( "Can", Can_A_Isr, FLEXCAN_B_IFLAG1_BUF63_32I, 2, 0 );
        break;
        case CAN_CTRL_C:
        ISR_INSTALL_ISR2( "Can", Can_C_BusOff, FLEXCAN_C_ESR_BOFF_INT, 2, 0 );
        ISR_INSTALL_ISR2( "Can", Can_C_Err, FLEXCAN_C_ESR_ERR_INT, 2, 0 );
        INSTALL_HANDLER16( "Can", Can_C_Isr, FLEXCAN_C_IFLAG1_BUF0I, 2, 0 );
        ISR_INSTALL_ISR2( "Can", Can_C_Isr, FLEXCAN_C_IFLAG1_BUF31_16I, 2, 0 );
        ISR_INSTALL_ISR2( "Can", Can_A_Isr, FLEXCAN_C_IFLAG1_BUF63_32I, 2, 0 );
        break;
        case CAN_CTRL_D:
        ISR_INSTALL_ISR2( "Can", Can_D_BusOff, FLEXCAN_D_ESR_BOFF_INT, 2, 0 );
        ISR_INSTALL_ISR2( "Can", Can_D_Err, FLEXCAN_D_ESR_ERR_INT, 2, 0 );
        INSTALL_HANDLER16( "Can", Can_D_Isr, FLEXCAN_D_IFLAG1_BUF0I, 2, 0 );
        ISR_INSTALL_ISR2( "Can", Can_D_Isr, FLEXCAN_D_IFLAG1_BUF31_16I, 2, 0 );
        ISR_INSTALL_ISR2( "Can", Can_A_Isr, FLEXCAN_D_IFLAG1_BUF63_32I, 2, 0 );
        break;
        case CAN_CTRL_E:
        ISR_INSTALL_ISR2( "Can", Can_E_BusOff, FLEXCAN_E_ESR_BOFF_INT, 2, 0 );
        ISR_INSTALL_ISR2( "Can", Can_E_Err, FLEXCAN_E_ESR_ERR_INT, 2, 0 );
        INSTALL_HANDLER16( "Can", Can_E_Isr, FLEXCAN_E_IFLAG1_BUF0I, 2, 0 );
        ISR_INSTALL_ISR2( "Can", Can_E_Isr, FLEXCAN_E_IFLAG1_BUF31_16I, 2, 0 );
        ISR_INSTALL_ISR2( "Can", Can_A_Isr, FLEXCAN_E_IFLAG1_BUF63_32I, 2, 0 );
        break;
#endif
#if defined(CFG_MPC5516) || defined(CFG_MPC5517) || defined(CFG_MPC5604B)
        case CAN_CTRL_F:
        ISR_INSTALL_ISR2( "Can", Can_F_BusOff, FLEXCAN_F_ESR_BOFF_INT, 2, 0 );
        ISR_INSTALL_ISR2( "Can", Can_F_Err, FLEXCAN_F_ESR_ERR_INT, 2, 0 );
        INSTALL_HANDLER16( "Can", Can_F_Isr, FLEXCAN_F_IFLAG1_BUF0I, 2, 0 );
        ISR_INSTALL_ISR2( "Can", Can_F_Isr, FLEXCAN_F_IFLAG1_BUF31_16I, 2, 0 );
        ISR_INSTALL_ISR2( "Can", Can_A_Isr, FLEXCAN_F_IFLAG1_BUF63_32I, 2, 0 );
        break;
#endif
        default:
            assert(0);
        }
    }
    return;
}

// Unitialize the module
void Can_DeInit()
{
    Can_UnitType *canUnit;
    const Can_ControllerConfigType *cfgCtrlPtr;
    uint32 ctlrId;

