openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Can.c
    for (int configId = 0; configId < CAN_ARC_CTRL_CONFIG_CNT; configId++) {
        cfgCtrlPtr = &Can_Global.config->CanConfigSet->CanController[(configId)];
        ctlrId = cfgCtrlPtr->CanControllerId;

        canUnit = CTRL_TO_UNIT_PTR(ctlrId);
        canUnit->state = CANIF_CS_UNINIT;

        Can_DisableControllerInterrupts(ctlrId);

        canUnit->lock_cnt = 0;

#if (USE_CAN_STATISTICS == STD_ON)
        // Clear stats
        memset(&canUnit->stats, 0, sizeof(Can_Arc_StatisticsType));
#endif
    }

    Can_Global.config = NULL;
    Can_Global.initRun = CAN_UNINIT;

    return;
}

void Can_InitController(uint8 controller,
        const Can_ControllerConfigType *config)
{
    /** @req 3.1.5/CAN229 */
    /** !req 3.1.5/CAN192 */

    flexcan_t *canHw;
    uint8_t tq;
    uint8_t tq1;
    uint8_t tq2;
    uint32_t clock;
    Can_UnitType *canUnit;
    uint8 cId = controller;
    const Can_ControllerConfigType *cfgCtrlPtr;
    const Can_HardwareObjectType *hohPtr;
    uint8_t fifoNr;

    /** @req 3.1.5/CAN187 */
    VALIDATE_NO_RV( (Can_Global.initRun == CAN_READY), CAN_INITCONTROLLER_SERVICE_ID, CAN_E_UNINIT );
    /** @req 3.1.5/CAN188 */
    VALIDATE_NO_RV( (config != NULL ), CAN_INITCONTROLLER_SERVICE_ID,CAN_E_PARAM_POINTER);
    /** !req 3.1.5/CAN189 Controller is controller number, not a sequence number? */
    VALIDATE_NO_RV( VALID_CONTROLLER(controller) , CAN_INITCONTROLLER_SERVICE_ID, CAN_E_PARAM_CONTROLLER );

    canUnit = CTRL_TO_UNIT_PTR(controller);
    /** @req 3.1.5/CAN190 */
    VALIDATE_NO_RV( (canUnit->state==CANIF_CS_STOPPED), CAN_INITCONTROLLER_SERVICE_ID, CAN_E_TRANSITION );

    canHw = canUnit->hwPtr;
    cfgCtrlPtr = canUnit->cfgCtrlPtr;

    // Start this baby up
    canHw->MCR.B.MDIS = 0;

    // Wait for it to reset
    if (!SIMULATOR()) {
        // Freeze to write all mem mapped registers ( see 25.4.8.1 )
        canHw->MCR.B.FRZ = 1;
        canHw->MCR.B.HALT = 1;
    }

    if( config->Can_Arc_Flags & CAN_CTRL_FIFO ) {
        canHw->MCR.B.FEN = 1;       /*  Enable FIFO */
        canHw->MCR.B.IDAM = 0;      /* We want extended id's to match with */
    }
    canHw->MCR.B.BCC = 1;           /* Enable all nice features */

    /* Use Fsys derivate */
    canHw->CR.B.CLKSRC = 1;
    canHw->MCR.B.MAXMB = cfgCtrlPtr->Can_Arc_MailboxMax - 1;


    /* Disable selfreception, if not loopback  */
    canHw->MCR.B.SRXDIS = (config->Can_Arc_Flags & CAN_CTRL_LOOPBACK) ? 0 : 1;

    /* Clock calucation
     * -------------------------------------------------------------------
     *
     * * 1 TQ = Sclk period( also called SCK )
     * * Ftq = Fcanclk / ( PRESDIV + 1 ) = Sclk
     *   ( Fcanclk can come from crystal or from the peripheral dividers )
     *
     * -->
     * TQ = 1/Ftq = (PRESDIV+1)/Fcanclk --> PRESDIV = (TQ * Fcanclk - 1 )
     * TQ is between 8 and 25
     */

    /* Calculate the number of timequanta's (from "Protocol Timing"( chap. 25.4.7.4 )) */
    tq1 = (config->CanControllerPropSeg + config->CanControllerSeg1 + 2);
    tq2 = (config->CanControllerSeg2 + 1);
    tq = 1 + tq1 + tq2;

    // Check TQ limitations..
    VALIDATE_DEM_NO_RV(( (tq1>=4) && (tq1<=16)), CAN_E_TIMEOUT );
    VALIDATE_DEM_NO_RV(( (tq2>=2) && (tq2<=8)), CAN_E_TIMEOUT );
    VALIDATE_DEM_NO_RV(( (tq>8) && (tq<25 )), CAN_E_TIMEOUT );

    // Assume we're using the peripheral clock instead of the crystal.
    clock = McuE_GetPeripheralClock((McuE_PeriperalClock_t) config->CanCpuClockRef);

    canHw->CR.B.PRESDIV = clock / (config->CanControllerBaudRate * 1000 * tq) - 1;
    canHw->CR.B.PROPSEG = config->CanControllerPropSeg;
    canHw->CR.B.PSEG1   = config->CanControllerSeg1;
    canHw->CR.B.PSEG2   = config->CanControllerSeg2;
    canHw->CR.B.SMP     = 1; // 3 samples better than 1 ??
    canHw->CR.B.LPB     = (config->Can_Arc_Flags & CAN_CTRL_LOOPBACK) ? 1 : 0;
    canHw->CR.B.BOFFREC = 1; // Disable bus off recovery

    /* Setup mailboxes for this controller */
    hohPtr = cfgCtrlPtr->Can_Arc_Hoh;
    uint8_t mbNr = 8;
    fifoNr = 0;

    assert( hohPtr != NULL );

    struct FLEXCAN_RXFIFO_t *fifoIdPtr = (struct FLEXCAN_RXFIFO_t *)&canHw->BUF[0];

    memset(&canHw->BUF[0],0,sizeof(struct canbuf_t)*cfgCtrlPtr->Can_Arc_MailboxMax);

    for( int i=0; i < 8;i++) {
        canHw->RXIMR[i].R = 0xfffffffful;
        fifoIdPtr->IDTABLE[i].R = 0x0;
    }

    /* The HOHs are sorted by FIFO(FULL_CAN), FIFO(BASIC_CAN),
     * FULL_CAN(no FIFO) and last BASIC_CAN(no FIFO) */
    for( int i=0; i < cfgCtrlPtr->Can_Arc_HohCnt;i++,hohPtr++)
    {
        if( ( hohPtr->CanObjectType != CAN_OBJECT_TYPE_RECEIVE) ) {
            continue;
        }

        /* Assign FIFO first it will search for match first there (its the first MBs) */
        if( cfgCtrlPtr->Can_Arc_HohFifoCnt != 0 ) {
            /* TODO : Set IDAM */

            /* Set the ID */
            fifoIdPtr->IDTABLE[fifoNr].R =  (hohPtr->CanIdValue << 1);
            if (hohPtr->CanIdType == CAN_ID_TYPE_EXTENDED) {
                fifoIdPtr->IDTABLE[fifoNr].R |= 0x40000000;
            }

            /* The Mask (we have FULL_CAN here) */
            canHw->RXIMR[fifoNr].R = *hohPtr->CanFilterMaskRef;
            fifoNr++;
        } else {
            canHw->BUF[mbNr].CS.B.CODE  = MB_RX;
            canHw->RXIMR[mbNr].R        = *hohPtr->CanFilterMaskRef;

            if (hohPtr->CanIdType == CAN_ID_TYPE_EXTENDED) {
                canHw->BUF[mbNr].CS.B.IDE    = 1;
                canHw->BUF[mbNr].ID.R        = hohPtr->CanIdValue;
            } else {
                canHw->BUF[mbNr].CS.B.IDE    = 0;
                canHw->BUF[mbNr].ID.B.STD_ID = hohPtr->CanIdValue;
            }
            mbNr++;
        }
    }

    canUnit->mbTxFree = canUnit->Can_Arc_TxMbMask;
    canUnit->state = CANIF_CS_STOPPED;
    Can_EnableControllerInterrupts(cId);

    return;
}

Can_ReturnType Can_SetControllerMode(uint8 controller,
        Can_StateTransitionType transition)
{
    /** @req 3.1.5/CAN230 */
    /** @req 3.1.5/CAN017 */
    /** !req 3.1.5/CAN294 Wakeup not supported */
    /** !req 3.1.5/CAN197 */
    /** !req 3.1.5/CAN201 */

    flexcan_t *canHw;
    imask_t state;
    Can_ReturnType rv = CAN_OK;

