openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Can.c
    Can_UnitType *canUnit = CTRL_TO_UNIT_PTR(controller);

    /** @req 3.1.5/CAN198 */
    VALIDATE( (canUnit->state!=CANIF_CS_UNINIT), 0x3, CAN_E_UNINIT );
    /** @req 3.1.5/CAN199 */
    VALIDATE( VALID_CONTROLLER(controller), 0x3, CAN_E_PARAM_CONTROLLER );

    canHw = canUnit->hwPtr;

    switch (transition) {
    case CAN_T_START:
        //canHw->MCR.B.FRZ = 0;
        canHw->MCR.B.HALT = 0;
        canUnit->state = CANIF_CS_STARTED;
        Irq_Save(state);
        /** @req 3.1.5/CAN196 */
        if (canUnit->lock_cnt == 0)
        {
            Can_EnableControllerInterrupts(controller);
        }
        Irq_Restore(state);
        break;
    case CAN_T_WAKEUP: //CAN267
    case CAN_T_SLEEP: //CAN258, CAN290
        // Should be reported to DEM but DET is the next best
        VALIDATE(canUnit->state == CANIF_CS_STOPPED, 0x3, CAN_E_TRANSITION);
    case CAN_T_STOP:
        // Stop
        //canHw->MCR.B.FRZ = 1;
        canHw->MCR.B.HALT = 1;
        canUnit->state = CANIF_CS_STOPPED;
        Can_AbortTx(canHw, canUnit); // CANIF282
        break;
    default:
        // Should be reported to DEM but DET is the next best
        /** @req 3.1.5/CAN200 */
        VALIDATE(canUnit->state == CANIF_CS_STOPPED, 0x3, CAN_E_TRANSITION);
        break;
    }

    return rv;
}

void Can_DisableControllerInterrupts(uint8 controller)
{
    /** @req 3.1.5/CAN231 */
    /** @req 3.1.5/CAN202 */
    /** !req 3.1.5/CAN204 */
    /** !req 3.1.5/CAN292 */

    Can_UnitType *canUnit = CTRL_TO_UNIT_PTR(controller);
    flexcan_t *canHw;
    imask_t state;

    /** @req 3.1.5/CAN205 */
    VALIDATE_NO_RV( (canUnit->state!=CANIF_CS_UNINIT), CAN_DISABLECONTROLLERINTERRUPTS_SERVICE_ID, CAN_E_UNINIT );

    /** @req 3.1.5/CAN206 */
    VALIDATE_NO_RV( VALID_CONTROLLER(controller) , CAN_DISABLECONTROLLERINTERRUPTS_SERVICE_ID, CAN_E_PARAM_CONTROLLER );


    Irq_Save(state);
    /** @req 3.1.5/CAN049 */
    if (canUnit->lock_cnt > 0) {
        // Interrupts already disabled
        canUnit->lock_cnt++;
        Irq_Restore(state);
        return;
    }
    canUnit->lock_cnt++;
    Irq_Restore(state);

    /* Don't try to be intelligent, turn everything off */
    canHw = GET_CONTROLLER(controller);

    /* Turn off the interrupt mailboxes */
    canHw->IMRH.R = 0;
    canHw->IMRL.R = 0;

    /* Turn off the bus off/tx warning/rx warning and error */
    canHw->MCR.B.WRNEN = 0; /* Disable warning int */
    canHw->CR.B.ERRMSK = 0; /* Disable error interrupt */
    canHw->CR.B.BOFFMSK = 0; /* Disable bus-off interrupt */
    canHw->CR.B.TWRNMSK = 0; /* Disable Tx warning */
    canHw->CR.B.RWRNMSK = 0; /* Disable Rx warning */
}

void Can_EnableControllerInterrupts(uint8 controller)
{
    /** @req 3.1.5/CAN232 */
    /** @req 3.1.5/CAN050 */
    /** !req 3.1.5/CAN293 Not applicable */

    Can_UnitType *canUnit;
    flexcan_t *canHw;
    imask_t state;

    canUnit = CTRL_TO_UNIT_PTR(controller);
    /** @req 3.1.5/CAN209 */
    VALIDATE_NO_RV( (canUnit->state!=CANIF_CS_UNINIT), CAN_ENABLECONTROLLERINTERRUPTS_SERVICE_ID, CAN_E_UNINIT );

    /** @req 3.1.5/CAN210 */
    VALIDATE_NO_RV( VALID_CONTROLLER(controller), CAN_ENABLECONTROLLERINTERRUPTS_SERVICE_ID, CAN_E_PARAM_CONTROLLER );

    Irq_Save(state);
    if (canUnit->lock_cnt > 1) {
        /** @req 3.1.5/CAN208 */
        // IRQ should still be disabled so just decrement counter
        canUnit->lock_cnt--;
        Irq_Restore(state);
        return;
    } else if (canUnit->lock_cnt == 1) {
        canUnit->lock_cnt = 0;
    }
    Irq_Restore(state);

    canHw = canUnit->hwPtr;

    canHw->IMRH.R = 0;
    canHw->IMRL.R = 0;

    if (canUnit->cfgCtrlPtr->Can_Arc_Flags & CAN_CTRL_RX_PROCESSING_INTERRUPT ) {
        /* Turn on the interrupt mailboxes */
        canHw->IMRL.R = canUnit->Can_Arc_RxMbMask;
        canHw->IMRH.R = (uint32_t)(canUnit->Can_Arc_RxMbMask>>32);
    }

    if (canUnit->cfgCtrlPtr->Can_Arc_Flags &  CAN_CTRL_TX_PROCESSING_INTERRUPT) {
        /* Turn on the interrupt mailboxes */
        canHw->IMRL.R |= canUnit->Can_Arc_TxMbMask;
        canHw->IMRH.R |= (uint32_t)(canUnit->Can_Arc_TxMbMask>>32);
    }

    // BusOff here represents all errors and warnings
    if (canUnit->cfgCtrlPtr->Can_Arc_Flags &  CAN_CTRL_BUSOFF_PROCESSING_INTERRUPT) {
        canHw->MCR.B.WRNEN = 1; /* Turn On warning int */

        canHw->CR.B.ERRMSK = 1; /* Enable error interrupt */
        canHw->CR.B.BOFFMSK = 1; /* Enable bus-off interrupt */
        canHw->CR.B.TWRNMSK = 1; /* Enable Tx warning */
        canHw->CR.B.RWRNMSK = 1; /* Enable Rx warning */
    }

    return;
}

Can_ReturnType Can_Write(Can_Arc_HTHType hth, Can_PduType *pduInfo)
{
    /** @req 3.1.5/CAN223 */
    /** !req 3.1.5/CAN213 Priorities not supported */
    /** !req 3.1.5/CAN215 Priorities not supported */
    /** @req 3.1.5/CAN214 */
    /** @req 3.1.5/CAN272 */

    uint16_t timer;
    uint64_t iflag;
    Can_ReturnType rv = CAN_OK;
    uint32_t mbNr;
    flexcan_t *canHw;
    const Can_HardwareObjectType *hohObj;
    Can_UnitType *canUnit;
    imask_t state;

    /** @req 3.1.5/CAN216 */
    VALIDATE( (Can_Global.initRun == CAN_READY), 0x6, CAN_E_UNINIT );
    /** @req 3.1.5/CAN219 */
    VALIDATE( (pduInfo != NULL), 0x6, CAN_E_PARAM_POINTER );
    /** @req 3.1.5/CAN218 */
    VALIDATE( (pduInfo->length <= 8), 0x6, CAN_E_PARAM_DLC );
    /** @req 3.1.5/CAN217 */
    VALIDATE( (hth < NUM_OF_HTHS ), 0x6, CAN_E_PARAM_HANDLE );

    canUnit = &CanUnit[Can_Global.config->CanConfigSet->ArcHthToUnit[hth]];
    hohObj  =  &canUnit->cfgHohPtr[Can_Global.config->CanConfigSet->ArcHthToHoh[hth]];
    canHw   =  canUnit->hwPtr;

    /* We have the hohObj, we need to know what box we can send on */
    Irq_Save(state);
    /* Get all free TX mboxes */
    uint64_t iHwFlag = *(uint64_t *)(&canHw->IFRH.R);  /* These are occupied */
    assert( (canUnit->Can_Arc_TxMbMask & hohObj->ArcMailboxMask) != 0);
    iflag = ~iHwFlag &  canUnit->mbTxFree & hohObj->ArcMailboxMask;
    /* Get the mbox(es) for this HTH */

    /** @req 3.1.5/CAN212 */
    if (iflag ) {
        mbNr = ilog2_64(iflag ); // find mb number

        /* Indicate that we are sending this MB */
        canUnit->mbTxFree &= ~(1ull<<mbNr);

        canHw->BUF[mbNr].CS.R = 0;
        canHw->BUF[mbNr].ID.R = 0;

